Revit 2027 API
ParameterTypeId.EnergyAnalysisPercentageGlazing Property
 "Target Percentage Glazing"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisPercentageGlazing { get; }
Public Shared ReadOnly Property EnergyAnalysisPercentageGlazing As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisPercentageGlazing {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisPercentageGlazing : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace